export const STATUS_MAP: Record<number, string> = {
    1: "Ожидание результатов",
    2: " ",
    3: "Ждем подтверджения от игрока 1",
    4: "Ждем подтверджения от игрока 2",
    5: "Счет игроков не совпадает",
    6: "Счет подтвержден",
    7: "Игра отменена",
    8: "Счет подтвержден автоматически",
    9: "Утверждено организатором",
    10: "Преимущество ✨",
} as const;

export const STATUS_MAP_EMOJI: Record<number, string> = {
    1: "⏳",
    2: " ",
    3: "⏳",
    4: "⏳",
    5: "⚠️",
    6: "✅",
    7: "🚫",
    8: "✅",
    9: "✅",
    10: "✨",
} as const;
